app/controllers/ideas_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "ideas" WHERE ("ideas".imaginer_id = 1)
SELECT * FROM "users" LIMIT 1
---
  def index
    if params[:user_id]
      @ideas = User.find(params[:user_id]).imaginings
    else
      @ideas = Idea.all

SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)
---
  def show
    @idea = Idea.find(params[:id])

SELECT * FROM "ideas" WHERE ("ideas"."id" = 2053932785)
---
  def edit
    @idea = Idea.find(params[:id])

INSERT INTO "ideas" ("price", "created_at", "title", "updated_at", "deadline", "description", "blurb", "imaginer_id") VALUES(1, '2009-09-24 21:48:06', 'superstition', '2009-09-24 21:48:06', NULL, 'stevie ray vaughn', NULL, NULL)
---
  def create
    @idea = Idea.new(params[:idea])
    @idea.imaginer_id = current_user


    respond_to do |format|
      if @idea.save

SELECT * FROM "ideas" WHERE ("ideas"."id" = 2053932785)
---
  def update
    @idea = Idea.find(params[:id])

SELECT * FROM "ideas" WHERE ("ideas"."id" = 2053932785)
DELETE FROM "ideas" WHERE "id" = 2053932785
---
  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy