app/controllers/invitations_controller.rb

INSERT INTO "invitations" ("created_at", "recipient_email", "token", "updated_at", "sent_at", "sender_id") VALUES('2009-08-30 22:18:50', 'captproton@tmail.com', '1099880176e2c5eb363163ae4a81282c15b6343d', '2009-08-30 22:18:50', NULL, NULL)
---
  def create
    @invitation = Invitation.new(params[:invitation])
    @invitation.sender = current_user
    if @invitation.save