app/controllers/likings_controller.rb

INSERT INTO "likings" ("rating", "created_at", "idea_id", "updated_at", "beliver_type", "believer_id") VALUES(NULL, '2009-09-22 18:41:23', NULL, '2009-09-22 18:41:23', NULL, NULL)
---
  def create
    @liking = Liking.new(params[:liking])
    if @liking.save