app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT * FROM "profiles"

  def show
    @user = User.find(params[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def create
    @profile = Profile.new(params[:profile])
    if @profile.save
---
INSERT INTO "profiles" ("created_at", "updated_at", "url", "about", "user_id", "twitter_handle") VALUES('2009-09-22 20:45:12', '2009-09-22 20:45:12', 'captproton.com', 'it''s me', NULL, 'captproton')

  def edit
    @profile = Profile.find(params[:id])
---
SELECT * FROM "profiles" WHERE ("profiles"."id" = 298486374)

  def update
    @profile = Profile.find(params[:id])
---
SELECT * FROM "profiles" WHERE ("profiles"."id" = 298486374)

  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy
---
SELECT * FROM "profiles" WHERE ("profiles"."id" = 298486374)
DELETE FROM "profiles" WHERE "id" = 298486374