app/controllers/transactions_controller.rb

SELECT * FROM "transactions" WHERE ("transactions"."id" = 1)
---
  def show
    @transaction = Transaction.find(params[:id])

INSERT INTO "transactions" ("created_at", "idea_id", "updated_at", "amount", "backer_id") VALUES('2009-09-19 00:15:21', NULL, '2009-09-19 00:15:21', 45, 1)
---
  def create
    @transaction = Transaction.new(params[:transaction])
    @transaction.backer = current_user

    respond_to do |format|
      if @transaction.save