app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "crypted_password", "updated_at", "facebook_uid", "username", "password_salt", "persistence_token", "invitiation_id", "email", "invitation_limit") VALUES(NULL, '2009-08-30 21:49:41', '20059061ffa166da86d2575c4b0f2ba5020c5f0bac82f6bee75be10f3c6a817a017ab3a0ddea8586b7aec06a50379cba50ae0a5692e764b1425d278b46eff34a', '2009-08-30 21:49:41', NULL, 'Sarah', 'CP4socdwK8c1W_HaelHS', '9f505710fb3d9a0b5742d69d3f8c956873b9e1c8e5b898f62431ffeb50b02d9411ac0f3a26a9f3725279a4e7d097889e03deaa961781175fec51d901a93415e6', NULL, 'sarah@betterbilling.net', 25)
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "persistence_token" = 'b77e978b5e1dac2f68ab84d84b9b4e5ea515971423b3117c57c2d10d8928e75d45ace535d3592b8755eca759f07a1bc99f6edd77d8c9696864e379e415e90039', "updated_at" = '2009-08-30 04:51:19', "password_salt" = 'mEunVd2nODaqO6s4tTqE', "crypted_password" = 'ceca57d0e28435e44e55c40ceb34af26ac0f0161746e2b531e34c387355c1c68bd581f50bd609f965c3b5251d29aee4bde818f58acf2817754e59a9fe5f25ee8' WHERE "id" = 2
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])